In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('Exercise.csv')
df

      Name   Age   Salary
0  Brijesh  44.0  72000.0
1     Ravi  27.0  48000.0
2    Mukul   NaN  54000.0
3    Rohit  38.0  61000.0
4     Ajay  40.0      NaN
5    Rajat  35.0  58000.0
6    Priya   NaN  52000.0
7   Shikha  48.0  79000.0

In [3]:
df.isnull().sum()

Name      0
Age       2
Salary    1
dtype: int64

In [4]:
df.mean()

Age          38.666667
Salary    60571.428571
dtype: float64

In [5]:
df2=df.fillna(df.mean())

In [6]:
df2.isnull().sum()

Name      0
Age       0
Salary    0
dtype: int64

In [7]:
df2

      Name        Age        Salary
0  Brijesh  44.000000  72000.000000
1     Ravi  27.000000  48000.000000
2    Mukul  38.666667  54000.000000
3    Rohit  38.000000  61000.000000
4     Ajay  40.000000  60571.428571
5    Rajat  35.000000  58000.000000
6    Priya  38.666667  52000.000000
7   Shikha  48.000000  79000.000000